In [3]:
People = {
    "first" : ['ujas','mahek','jigar'],
    "last" : ['lathiya','khanapara','vavaliya'],
    "email" : ['ujas123@gmail.com','mahek234@gmail.com','jigar@gmail.com']
}

In [4]:
import pandas as pd
df = pd.DataFrame(People)
df

   first       last               email
0   ujas    lathiya   ujas123@gmail.com
1  mahek  khanapara  mahek234@gmail.com
2  jigar   vavaliya     jigar@gmail.com

In [5]:
df['email']

0     ujas123@gmail.com
1    mahek234@gmail.com
2       jigar@gmail.com
Name: email, dtype: object

In [6]:
df[['first','last']]

   first       last
0   ujas    lathiya
1  mahek  khanapara
2  jigar   vavaliya

In [7]:
df.email

0     ujas123@gmail.com
1    mahek234@gmail.com
2       jigar@gmail.com
Name: email, dtype: object

In [8]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [9]:
df.iloc[0]

first                 ujas
last               lathiya
email    ujas123@gmail.com
Name: 0, dtype: object

In [11]:
df.iloc[[0,1]]

   first       last               email
0   ujas    lathiya   ujas123@gmail.com
1  mahek  khanapara  mahek234@gmail.com

In [12]:
df.iloc[[0,1], 2]

0     ujas123@gmail.com
1    mahek234@gmail.com
Name: email, dtype: object

In [13]:
df.iloc[[0,1], [0,1]]

   first       last
0   ujas    lathiya
1  mahek  khanapara

In [15]:
df.loc[[0,1],'email']

0     ujas123@gmail.com
1    mahek234@gmail.com
Name: email, dtype: object

In [16]:
df.loc[[0,1],['first','last']]

   first       last
0   ujas    lathiya
1  mahek  khanapara

In [17]:
df.loc[0:2, 'first':'email']

   first       last               email
0   ujas    lathiya   ujas123@gmail.com
1  mahek  khanapara  mahek234@gmail.com
2  jigar   vavaliya     jigar@gmail.com